{
    "realms": [
        {
            "realm": "0xca4e99c58beec6c314816e9209293b327942e50a",
            "questlineUrl": "...",
            "questlineHash": "0xhashafrash",
            "questlineName": "Transact on PGN",
            "description": "Gitcoin is a community that focuses on incentivizing and supporting open-source development. Gitcoin aims to foster collaboration and sustainability within the open-source ecosystem by providing a marketplace for matching developers with projects and funding opportunitie and rewards for their contributions.",
            "quests": [
                {
                    "name": "Execute individual transactions on PGN (Public Goods Network)",
                    "description": "The more transactions you execute on PGN compared to other members of this realm in a week, the more of the weekly XP drop you will get."
                },
                {
                    "name": "Spend gas on PGN (Public Goods Network)—more gas is better!",
                    "description": "The more gas you use on PGN compared to other members of this realm in a week, the more of the weekly XP drop you will get. This means you can still get more XP if you execute fewer bigger transactions!"
                }
            ]
        },
        {
            "realm": "0xa0e6509aa077e6d9fab24f36bc3837f3c07ba215",
            "questlineUrl": "...",
            "questlineHash": "0xhashafrash",
            "questlineName": "Use your CyberWallet",
            "description": "Cyberconnect is a Web3 social ecosystem that goes beyond likes and shares. It allows developers to create social applications where users have complete control over their digital identity, content, and connections ",
            "quests": [
                {
                    "name": "Spend gas using the CyberWallet associated with your address",
                    "description": "The more gas you use with your CyberWallet across networks compared to other members of this realm in a week, the more of the weekly XP drop you will get."
                }
            ]
        },
        {
            "realm": "0x25f59fb6bc988c9af5cbb9e105c20971b4b420db",
            "questlineUrl": "...",
            "questlineHash": "0xhashafrash",
            "questlineName": "Transact on Arbitrum",
            "description": "Arbitrum DAO is a decentralized autonomous organization (DAO) built on the Ethereum blockchain. At its core, the Arbitrum DAO is a community-driven governance mechanism that allows $ARB token holders to propose and vote on changes to the organization and the technologies it governs.",
            "quests": [
                {
                    "name": "Execute individual transactions on Arbitrum",
                    "description": "The more transactions you execute on Arbitrum compared to other members of this realm in a week, the more of the weekly XP drop you will get."
                }
            ]
        },
        {
            "realm": "0x0391b2ae6fd9dca3f862994bf7a4f187a21686eb",
            "questlineUrl": "...",
            "questlineHash": "0xhashafrash",
            "questlineName": "Eat your OATs",
            "description": "Galxe is the largest web3 credential data network that is helping projects and developers to build robust decentralized products. Earn oat, NFTs, and tokens by contributing to your favorite Web3 communities.",
            "quests": [
                {
                    "name": "Claim OATs during the week",
                    "description": "The more OATs you claim across networks compared to other members of this realm in a week, the more of the weekly XP drop you will get."
                }
            ]
        },
        {
            "realm": "0x604d11d9f17b22740a6b32b3d6202847f7c42087",
            "questlineUrl": "...",
            "questlineHash": "0xhashafrash",
            "questlineName": "The bribes must flow",
            "description": "Frax Finance is a decentralized cross-chain protocol that aims to establish a scalable, digital currency with a flexible supply, backed algorithmically and by collateral.",
            "quests": [
                {
                    "name": "Fund bribes on Votemarket",
                    "description": "The more total USD value in bribes you commit on Votemarket in a week, the more of the weekly XP drop you will get."
                }
            ]
        }
    ]
}
